In [1]:
import pandas as pd

### Create a python dictionary and convert to a pandas dataframe

In [2]:
data = {"oranges":[2,8,0,6,7],"apples":[3,8,2,0,6],"bananas":[5,6,1,3,0]}

In [3]:
data

{'oranges': [2, 8, 0, 6, 7],
 'apples': [3, 8, 2, 0, 6],
 'bananas': [5, 6, 1, 3, 0]}

### Create the data frame with my own custom indeces

In [4]:
df1 = pd.DataFrame(data, index=["Jane","John","James","Abigail","Francis"])

In [5]:
df1

         oranges  apples  bananas
Jane           2       3        5
John           8       8        6
James          0       2        1
Abigail        6       0        3
Francis        7       6        0

In [6]:
type(df1)

pandas.core.frame.DataFrame

### Different ways to access a dataframe object column

In [7]:
df1 ["apples"]

Jane       3
John       8
James      2
Abigail    0
Francis    6
Name: apples, dtype: int64

In [8]:
a1= df1["apples"]

In [9]:
a1

Jane       3
John       8
James      2
Abigail    0
Francis    6
Name: apples, dtype: int64

In [10]:
type(a1)

pandas.core.series.Series

### this method is however not recommended

In [11]:
a2=df1.apples

In [12]:
a2

Jane       3
John       8
James      2
Abigail    0
Francis    6
Name: apples, dtype: int64

In [13]:
type(a2)

pandas.core.series.Series

### Explore inbuilt methods both in DataFrame and Series

In [14]:
df1.columns

Index(['oranges', 'apples', 'bananas'], dtype='object')

In [15]:
 c = df1.columns

In [16]:
type(c)

pandas.core.indexes.base.Index

In [17]:
cl = list(c)

In [18]:
type(cl)

list

In [19]:
cl

['oranges', 'apples', 'bananas']

### Change the column named  "apple" to "lemon"

In [20]:
cl[1]='Lemons'

In [21]:
cl

['oranges', 'Lemons', 'bananas']

In [40]:
df2 = df1.rename({'apples':'lemons'},axis='columns')

In [41]:
df2

         oranges  lemons  bananas
Jane           2       3        5
John           8       8        6
James          0       2        1
Abigail        6       0        3
Francis        7       6        0

In [42]:
o = df1['oranges']

In [43]:
o.Francis

7

In [44]:
df1.loc['Francis']

oranges    7
lemons     6
bananas    0
Name: Francis, dtype: int64

In [63]:
m = df2.loc['Francis']

In [64]:
m

oranges    7
lemons     6
bananas    0
Name: Francis, dtype: int64

### Accessing Francis Row and 2 colums

In [47]:
m = df2.loc ['Francis', ['lemons','bananas']]

In [48]:
m

lemons     6
bananas    0
Name: Francis, dtype: int64

### Accessing 2 rows and two columns

In [49]:
df2.loc[['Jane','John'],['oranges','bananas']]

      oranges  bananas
Jane        2        5
John        8        6

In [50]:
o = df2['oranges']

In [51]:
type(o)

pandas.core.series.Series

In [52]:
ol = df2[['oranges','lemons']]

In [53]:
ol

         oranges  lemons
Jane           2       3
John           8       8
James          0       2
Abigail        6       0
Francis        7       6

In [60]:
type(ol)

pandas.core.frame.DataFrame

In [61]:
od = df2[['oranges']]

In [62]:
type(od)

pandas.core.frame.DataFrame